Revit 2026 API

# RebarConstraintsStatus Enumeration

---

Describes the status of the constraints

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarConstraintsStatus
```
```vb
Public Enumeration RebarConstraintsStatus
```
```cpp
public enum class RebarConstraintsStatus
```
```fsharp
type RebarConstraintsStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| AllDisabled | 1 | All constraints are disabled. |
| Enabled | 0 | All constraints are enabled. |
| SomeDisabled | 2 | Some constraints are disabled, and the others or enabled. |

#### Reference

Autodesk.Revit.DB.Structure Namespace